ElemTypeInfo.m_oldParamSet
SERIALIZED BUT NOT SAVED - keeps track of old set of parameters, set when getParamSetFW is called

ElemTypeInfo.m_paramSet
set of parameters associated with elements of this type

ElemTypeInfo.m_oldSymbolId
SERIALIZED BUT NOT SAVED -  keeps track of whether the symbol Id has changed

ElemTypeInfo.m_symbolId
master symbol id for all elements of this type

ElemTypeInfo.m_type
Stores the type reference, this allows matching between held elements and type infos

ElemTypeInfo.updateElementProperties(ControlledConstDocAccess!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,HeldElement!System.Runtime.CompilerServices.IsConst*)
Takes in a HeldElement and updates the properties and/or MasterSymbol of the element
associated with it according to this ElemTypeInfo's data

ElemTypeInfo.updateElementPosition(ControlledConstDocAccess!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,HeldElement!System.Runtime.CompilerServices.IsConst*)
Takes in a HeldElement and updates the position of the element associated with the held
element according to the locations specified by the held element

ElemTypeInfo.createElement(ADocument*,HeldElement*,Element!System.Runtime.CompilerServices.IsConst*)
Takes in a HeldElement and creates a new element of the appropriate type.
Returns new element's id or invalidElementId if unable to create new element
Also updates HeldElement to contain new ElementId

ElemTypeInfo.clearOldValues
Clears old values, use this function to make hasChanged return false after changes have been propagated

ElemTypeInfo.hasChanged
Has the type info changed since last time it was used to update the system

ElemTypeInfo
This class is meant to be extended for each type of element that can be created
The is the only class in a system that knows how to manipulate the elements associated
with it's m_type. For example BeamElemTypeInfo used in trusses knows how to manipulate
beams. The Truss implementation does not need to know what type of element it is updating and can
use the functions provided by the ElemTypeInfo to manipulate its child elements.